<a href="https://colab.research.google.com/github/adudars/PedidON/blob/master/arquivos/9.7_ConsultasGroupBy%26FuncoesAgrupamento.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 9.7 CONSULTAS COM GROUP BY E FUNÇÕES DE AGRUPAMENTO

## ESTABELECENDO CONEXÃO

### Instalando bibliotecas de acesso

In [1]:
#!pip install --user psycopg2-binary
#!pip install --user pandas

### Importando bibliotecas

In [3]:
import pandas as pd
import psycopg2

### Conectando com o banco através do psycopg2

In [4]:
conn = psycopg2.connect(host="lallah.db.elephantsql.com",database="nxthbnlu", user="nxthbnlu", password="buyAYKsY17pqexg1grIcJaWm0gHBsO2F")

## CONSULTAS

### Média de preço de comanda

In [5]:
avg_preco_comanda = pd.read_sql_query("""select id_comanda, nome_cliente, nome_funcionario, avg(preco) as media_preco
                                      from comanda as c
                                      inner join pedido as p on
                                      (c.id_comanda = p.fk_id_comanda)
                                      inner join item_cardapio as ic on
                                      (p.fk_id_itemcardapio = ic.id_itemcardapio)
                                      inner join cliente as cl on
                                      (cl.id_cliente = c.fk_id_cliente)
                                      inner join funcionario as f on
                                      (f.id_funcionario = c.fk_id_funcionario)
                                      group by id_comanda, nome_cliente, nome_funcionario
                                      order by id_comanda;""", conn)

In [6]:
avg_preco_comanda

    id_comanda nome_cliente nome_funcionario  media_preco
0            1         Lara         Bernardo    55.950000
1            2        Jorge         Bernardo   145.000000
2            3        Clara          Matheus    54.300000
3            4         Davi           Ismael    15.945000
4            5       Milton          Matheus     6.900000
5            6        Jorge           Ismael    43.400000
6            7        Luiza         Bernardo    55.000000
7            8          Ana          Matheus   130.000000
8            9         Tais           Ismael    22.000000
9           10         Davi         Bernardo    19.263333
10          11        Jorge          Matheus     6.900000
11          12     Isabella           Ismael    55.950000
12          13     Henrique          Matheus    76.975000

### Maior preço de item por comanda

In [7]:
max_preco_comanda = pd.read_sql_query("""select id_comanda, max(preco) as preço_max
                                  from item_cardapio as ic
                                  inner join pedido as p on
                                  (p.fk_id_itemcardapio = ic.id_itemcardapio)
                                  inner join comanda as c on
                                  (c.id_comanda = p.fk_id_comanda)
                                  group by id_comanda
                                  order by id_comanda;""", conn)

In [8]:
max_preco_comanda

    id_comanda  preço_max
0            1       56.9
1            2      145.0
2            3      115.0
3            4       25.9
4            5        6.9
5            6       56.9
6            7       55.0
7            8      145.0
8            9       22.0
9           10       25.9
10          11        6.9
11          12       56.9
12          13      145.0

### Quantidade de comandas por cliente

In [9]:
count_comandas = pd.read_sql_query("""select nome_cliente, count(id_comanda) as quantidade_comandas
                                    from comanda as c
                                    inner join cliente as cl on
                                    (cl.id_cliente = c.fk_id_cliente)
                                    group by nome_cliente;""", conn)

In [10]:
count_comandas

  nome_cliente  quantidade_comandas
0         Lara                    1
1          Ana                    1
2        Jorge                    3
3         Tais                    1
4     Isabella                    1
5        Clara                    1
6         Davi                    2
7       Milton                    1
8     Henrique                    1
9        Luiza                    1

### Valor total da comanda por soma dos preços dos itens pedidos

In [11]:
soma_preco_comanda = pd.read_sql_query("""select id_comanda, sum(preco) as valor_total
                              from comanda as c
                              inner join pedido as p on
                              (c.id_comanda = p.fk_id_comanda)
                              inner join item_cardapio as ic on
                              (p.fk_id_itemcardapio = ic.id_itemcardapio)
                              group by id_comanda
                              order by valor_total desc;""", conn)

In [12]:
soma_preco_comanda

    id_comanda  valor_total
0           13       307.90
1            8       260.00
2            3       162.90
3            2       145.00
4            1       111.90
5           12       111.90
6            6        86.80
7           10        57.79
8            7        55.00
9            4        31.89
10           9        22.00
11          11         6.90
12           5         6.90

### Quantidade de comandas atendidas por funcionário

In [13]:
count_funcionario_comanda = pd.read_sql_query("""select nome_funcionario, count(nome_funcionario) as comandas_atendidas
                              from comanda as c
                              inner join pedido as p on
                              (c.id_comanda = p.fk_id_comanda)
                              inner join funcionario as f on
                              (c.fk_id_funcionario = f.id_funcionario)
                              group by nome_funcionario;""", conn)

In [14]:
count_funcionario_comanda

  nome_funcionario  comandas_atendidas
0          Matheus                  11
1         Bernardo                   7
2           Ismael                   7

### Menor preço de item por comanda

In [26]:
min_preco_comanda = pd.read_sql_query("""select id_comanda, min(preco) as menor_valor_pedido
                                          from comanda as c
                                          inner join pedido as p on
                                          (c.id_comanda = p.fk_id_comanda)
                                          inner join item_cardapio as ic on
                                          (p.fk_id_itemcardapio = ic.id_itemcardapio)
                                          group by id_comanda
                                          order by id_comanda;""", conn)

In [27]:
min_preco_comanda

    id_comanda  menor_valor_pedido
0            1               55.00
1            2              145.00
2            3               22.00
3            4                5.99
4            5                6.90
5            6               29.90
6            7               55.00
7            8              115.00
8            9               22.00
9           10                5.99
10          11                6.90
11          12               55.00
12          13               22.00